Revit 2024 API
BuiltInFailures.SketchFailures.BentFabricSheetClosedLoopInSketch Property
 The bend profile cannot contain a closed loop. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BentFabricSheetClosedLoopInSketch { get; }
Visual Basic
Public Shared ReadOnly Property BentFabricSheetClosedLoopInSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BentFabricSheetClosedLoopInSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace